<?php
    /*
        砝码称重(NOIP1996)
        【问题描述】
        设有1g、2g、3g、5g、10g、20g的砝码各若干枚(其总重<=1000)
        求用这些砝码能称出不同的重量的个数
        【输入文件】
        输入1g、2g、3g、5g、10g、20g的砝码个数
        【输出文件】
        能称出不同的重量的个数
        【输入样例】
        1 1 0 0 0 0
        【输出样例】
        3
    */

    $type = array(1,2,3,5,10,20);
    $num = array(1,1,0,0,0,0);
    $w = array();
    // 1.统计砝码总数，准备好砝码序列；
    for($i=0;$i<count($type);$i++){
        for($j=0;$j<$num[$i];$j++){
            $w[] = $type[$i];
        }
    }

    // var_dump($w);
    $r = a($w);
    function a($w){
        $f = array(array());
        // 算法思路：
        // 1.统计砝码总数，准备好砝码序列；
        // 2.初始化动态规划数组，做动态规划；
        for($i=0;$i<=1000;$i++){
            $f[$i][0] = 1;
        }
        var_dump($f);exit;
        for($i=1;$i<count($w);$i++){
            for($j=1;$j<=1000;$j++){
                if($j-$w[$i] >= 0){
                    $f[$i][$j] = isset($f[$i-1][$j]) ? $f[$i-1][$j] : ''|| isset($f[$i-1][$j-$w[$i]]) ? $f[$i-1][$j-$w[$i]] : '';
                }else{
                    $f[$i][$j] = isset($f[$i-1][$j]) ? $f[$i-1][$j] : '';
                }
            }
        }
        // 3.统计方案总数； 
        $sum = 0;
        for($i=1;$i<=1000;$i++){
            if(isset($f[count($w)][$i]) ? $f[count($w)][$i] : ''){
                $sum++;
            }
        }
        echo $sum;
    }
